app/Controllers/Biodata.php

    public function index()
    {
        $model = new BiodataModel();
        $data['biodata'] = $model->findAll();
---
SELECT *
FROM `biodata`

    public function edit($id)
    {
        $model = new BiodataModel();
        $data['biodata'] = $model->find($id);
---
SELECT *
FROM `biodata`
WHERE `biodata`.`id` = '2'

    public function hapus($id)
    {
        $model = new BiodataModel();
        $model->delete($id);
---
DELETE FROM `biodata`
WHERE `id` IN ('1')