app/Controllers/Register.php

INSERT INTO `users` (`user_name`, `user_email`, `user_password`) VALUES ('eko', 'whyueko@hotmail.com', '$2y$10$tbOLb9YP9KKtW.HrymWKAeWrGppq32If7vsOJ75oLkXDOTB2Es7NS')
---
    public function save()
    {
        //include helper form
        helper(['form']);
        //set rules validation form
        $rules = [
            'name'          => 'required|min_length[3]|max_length[20]',
            'email'         => 'required|min_length[6]|max_length[50]|valid_email|is_unique[users.user_email]',
            'password'      => 'required|min_length[6]|max_length[200]',
            'confpassword'  => 'matches[password]',
        ];

        if ($this->validate($rules)) {
            $model = new UserModel();
            $data = [
                'user_name'     => $this->request->getVar('name'),
                'user_email'    => $this->request->getVar('email'),
                'user_password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT),
            ];
            $model->save($data);