app/Models/Barang_model.php

SELECT *
FROM `m_barang`
---
    public function getBarang($id = false)
    {
        if ($id === false) {
            return $this->findAll();

INSERT INTO `m_barang` (`nama_barang`, `qty`, `harga_beli`, `harga_jual`) VALUES ('sepeda', '6', '10000', '20000')
---
    public function saveBarang($data): BaseResult|bool|query
    {
        $builder = $this->db->table($this->table);
        return $builder->insert(set: $data);